docs/softwares/wrk.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-19 二 16:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>wrk&#x2013;HTTP 基准测试工具</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">wrk&#x2013;HTTP 基准测试工具</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org73113d1">1. 概述</a></li>
<li><a href="#org80d573c">2. 安装</a></li>
<li><a href="#org2361d53">3. 使用</a>
<ul>
<li><a href="#org0609fe5">3.1. 基本使用</a></li>
<li><a href="#orgbddee54">3.2. 常用参数</a></li>
<li><a href="#org8d25bca">3.3. 使用脚本</a></li>
</ul>
</li>
<li><a href="#org8a6eac6">4. 基准测试注意</a></li>
</ul>
</div>
</div>

<div id="outline-container-org73113d1" class="outline-2">
<h2 id="org73113d1"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/wg/wrk">wrk</a> 是一款现代 HTTP 基准测试工具，在单个多核 CPU 上运行时，也能够产生大量负载。它结合了多线程设计和可扩展的事件通知系统，例如 epoll 和 kqueue。
</p>

<p>
可选的 LuaJIT 脚本可以生成 HTTP 请求，处理响应和自定义报告。
</p>
</div>
</div>

<div id="outline-container-org80d573c" class="outline-2">
<h2 id="org80d573c"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">brew install wrk
</pre>
</div>
</div>
</div>
<div id="outline-container-org2361d53" class="outline-2">
<h2 id="org2361d53"><span class="section-number-2">3</span> 使用</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0609fe5" class="outline-3">
<h3 id="org0609fe5"><span class="section-number-3">3.1</span> 基本使用</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">wrk -t12 -c400 -d30s http://127.0.0.1:8080/index.html
</pre>
</div>

<p>
它使用 12 个线程，并保持 400 个 HTTP 连接打开的状态，运行 30 秒的基准测试。
</p>

<pre class="example">
Running 30s test @ http://127.0.0.1:8080/index.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max     +/- Stdev
    Latency   635.91us    0.89ms  12.92ms   93.69%
    Req/Sec    56.20k     8.07k   62.00k    86.54%
  22464657 requests in 30.00s, 17.76GB read
Requests/sec: 748868.53 （平均每秒处理请求书）
Transfer/sec:    606.33MB （平均每秒传输数据）
</pre>

<p>
标准差：反映数据集的离散程度。
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" width="auto">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">项目</th>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Avg</td>
<td class="org-left">平均值</td>
<td class="org-left">每次测试的平均值</td>
</tr>

<tr>
<td class="org-left">Stdev</td>
<td class="org-left">标准偏差</td>
<td class="org-left">结果的离散程度，越高说明越不稳定</td>
</tr>

<tr>
<td class="org-left">Max</td>
<td class="org-left">最大值</td>
<td class="org-left">最大的一次结果</td>
</tr>

<tr>
<td class="org-left">+/- Stdev</td>
<td class="org-left">正负一个标准差占比</td>
<td class="org-left">结果的离散程度，越大越不稳定</td>
</tr>

<tr>
<td class="org-left">Latency</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">可以理解为响应时间</td>
</tr>

<tr>
<td class="org-left">Req/Sec</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">每个线程每秒钟的完成的请求数</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgbddee54" class="outline-3">
<h3 id="orgbddee54"><span class="section-number-3">3.2</span> 常用参数</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><code>-c, --connections &lt;N&gt;</code> : 要保持打开状态的 HTTP 连接总数。每个线程处理 <code>N=connections/threads</code></li>
<li><code>-d, --duration &lt;T&gt;</code>: 测试的持续时间，例如 2s，2m，2h -t。</li>
<li><code>-t, --threads &lt;N&gt;</code>: 要使用的线程总数。</li>
<li><code>-s, --script &lt;S&gt;</code>: LuaJIT 脚本</li>
<li><code>-H, --header &lt;H&gt;</code>: 要添加到请求中的 HTTP 标头，例如  "User-Agent: wrk"</li>
<li><code>--latency</code>: 打印详细的延迟统计信息</li>
<li><code>--timeout &lt;T&gt;</code>: 如果未在其中收到响应，则记录在这个总的超时时间里。</li>
</ul>

<p>
数字参数可以带 SI unit (1k, 1M, 1G)
</p>

<p>
时间参数可以带 time unit (2s, 2m, 2h)
</p>
</div>
</div>


<div id="outline-container-org8d25bca" class="outline-3">
<h3 id="org8d25bca"><span class="section-number-3">3.3</span> 使用脚本</h3>
<div class="outline-text-3" id="text-3-3">
<p>
参考 <a href="https://www.cnblogs.com/xinzhao/p/6233009.html">https://www.cnblogs.com/xinzhao/p/6233009.html</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org8a6eac6" class="outline-2">
<h2 id="org8a6eac6"><span class="section-number-2">4</span> 基准测试注意</h2>
<div class="outline-text-2" id="text-4">
<p>
运行 wrk 的计算机必须具有足够数量的临时端口，并且关闭的 socket 应快速回收。为了处理突发的连接初始化，服务器的 listen(2) backlog 应该大于正在测试的并发连接的数量。
</p>

<p>
仅更改 HTTP 方法、path，添加 header 或 body 的用户脚本不会对性能产生影响。每个请求的操作，特别是构建新的 HTTP 请求以及使用 response() 必然会减少可以生成的请求量。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-05-19 二 16:39</p>
<p class="validation"></p>
</div>
</body>
</html>
